In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
labels = ["a","b", "c"]
liste = [10, 20, 30]
arr = np.array(liste)
d = {"a": 10, "b": 20, "c": 30}

In [3]:
pd.Series(data=liste)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=liste, index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int32

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [9]:
pd.Series([sum, print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [10]:
ser1 = pd.Series([1,2,3], ["USA","DE","UK"])

In [11]:
ser1

USA    1
DE     2
UK     3
dtype: int64

In [14]:
ser2 = pd.Series([4,5,6], ["USA","DE", "IT"])

In [15]:
ser2

USA    4
DE     5
IT     6
dtype: int64

In [16]:
ser1["DE"]

2

In [17]:
ser2["USA"]

4

In [18]:
ser1+ser2

DE     7.0
IT     NaN
UK     NaN
USA    5.0
dtype: float64

In [4]:
np.random.seed(101)

In [6]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(), columns='W X Y Z'.split())

In [7]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [8]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [9]:
df[["W","Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [10]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [12]:
type(df['W'])

pandas.core.series.Series

In [13]:
df["neu"] = df['W'] + df['Y']

In [14]:
df

          W         X         Y         Z       neu
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [15]:
df.drop('neu', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df

          W         X         Y         Z       neu
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [17]:
df.drop('neu', axis=1, inplace=True)

In [18]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [20]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [21]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [22]:
df.loc['B','Y']

-0.8480769834036315

In [23]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [24]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [26]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [27]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [31]:
df[df['W']>0][['Y','X','W']]

          Y         X         W
A  0.907969  0.628133  2.706850
B -0.848077 -0.319318  0.651118
D -0.933237 -0.758872  0.188695
E  2.605967  1.978757  0.190794

In [33]:
df[(df['W']> 0) |(df["Y"]>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [36]:
neuind = "BY BW HH BB NW".split()

In [37]:
neuind

['BY', 'BW', 'HH', 'BB', 'NW']

In [38]:
df["Staaten"] = neuind

In [39]:
df

          W         X         Y         Z Staaten
A  2.706850  0.628133  0.907969  0.503826      BY
B  0.651118 -0.319318 -0.848077  0.605965      BW
C -2.018168  0.740122  0.528813 -0.589001      HH
D  0.188695 -0.758872 -0.933237  0.955057      BB
E  0.190794  1.978757  2.605967  0.683509      NW

In [40]:
df.set_index('Staaten')

                W         X         Y         Z
Staaten
BY       2.706850  0.628133  0.907969  0.503826
BW       0.651118 -0.319318 -0.848077  0.605965
HH      -2.018168  0.740122  0.528813 -0.589001
BB       0.188695 -0.758872 -0.933237  0.955057
NW       0.190794  1.978757  2.605967  0.683509

In [41]:
df

          W         X         Y         Z Staaten
A  2.706850  0.628133  0.907969  0.503826      BY
B  0.651118 -0.319318 -0.848077  0.605965      BW
C -2.018168  0.740122  0.528813 -0.589001      HH
D  0.188695 -0.758872 -0.933237  0.955057      BB
E  0.190794  1.978757  2.605967  0.683509      NW

In [43]:
df.set_index('Staaten', inplace=True)

In [44]:
df

                W         X         Y         Z
Staaten
BY       2.706850  0.628133  0.907969  0.503826
BW       0.651118 -0.319318 -0.848077  0.605965
HH      -2.018168  0.740122  0.528813 -0.589001
BB       0.188695 -0.758872 -0.933237  0.955057
NW       0.190794  1.978757  2.605967  0.683509

In [50]:
aussen =['G1','G1','G1','G2','G2','G2']
innen = [1,2,3,1,2,3]
hier_index = list(zip(aussen, innen))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [51]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [52]:
hier_index = list(zip(aussen, innen))

In [53]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [54]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [55]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [58]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index, columns=["A","B"])

In [59]:
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [62]:
df.loc['G1'].loc[2]

A   -0.943406
B    0.484752
Name: 2, dtype: float64

In [64]:
df.index.names = ["Gruppe", "Num"]

In [65]:
df

                   A         B
Gruppe Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [67]:
df.xs(["G1",1])

C:\Users\Oliver\AppData\Local\Temp\ipykernel_10740\4181962490.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(["G1",1])

A   -0.497104
B   -0.754070
Name: (G1, 1), dtype: float64

In [68]:
df.xs(1,level="Num")

               A         B
Gruppe
G1     -0.497104 -0.754070
G2      0.238127  1.996652

In [2]:
df = pd.DataFrame( {'A': [1,2, np.nan], 'B':[5, np.nan, np.nan], 'C':[1,2,3]} )

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [5]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [8]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
df.fillna(value='Füllwert')

          A         B  C
0       1.0       5.0  1
1       2.0  Füllwert  2
2  Füllwert  Füllwert  3

In [10]:
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [11]:
df['A'].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [13]:
df['B'].fillna(value=df["A"].mean())

0    5.0
1    1.5
2    1.5
Name: B, dtype: float64

In [14]:
# Data Frame erstellen
data = {'Firma':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [15]:
df = pd.DataFrame(data)

In [16]:
df

  Firma   Person  Sales
0  GOOG      Sam    200
1  GOOG  Charlie    120
2  MSFT      Amy    340
3  MSFT  Vanessa    124
4    FB     Carl    243
5    FB    Sarah    350

In [20]:
df.groupby('Firma').mean()

       Sales
Firma
FB     296.5
GOOG   160.0
MSFT   232.0

In [21]:
nach_firma = df.groupby('Firma')

In [23]:
nach_firma.mean()

       Sales
Firma
FB     296.5
GOOG   160.0
MSFT   232.0

In [24]:
nach_firma.std()

            Sales
Firma
FB      75.660426
GOOG    56.568542
MSFT   152.735065

In [25]:
nach_firma.min()

        Person  Sales
Firma
FB        Carl    243
GOOG   Charlie    120
MSFT       Amy    124

In [26]:
nach_firma.max()

        Person  Sales
Firma
FB       Sarah    350
GOOG       Sam    200
MSFT   Vanessa    340

In [27]:
nach_firma.count()

       Person  Sales
Firma
FB          2      2
GOOG        2      2
MSFT        2      2

In [28]:
nach_firma.describe()

      Sales
      count   mean         std    min     25%    50%     75%    max
Firma
FB      2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT    2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [29]:
nach_firma.describe().transpose()

Firma                FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [30]:
nach_firma.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [31]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [32]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [33]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [34]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [35]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [37]:
pd.concat([df1,df2],axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [38]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [39]:
links = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
rechts = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [40]:
links

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [41]:
rechts

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [42]:
pd.merge(links,rechts)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [44]:
pd.merge(links,rechts, how='inner', on="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [45]:
links = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
rechts = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [46]:
links

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [47]:
rechts

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [49]:
pd.merge(links,rechts,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [50]:
pd.merge(links,rechts,on=['key1','key2'], how='outer')

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [51]:
pd.merge(links,rechts,on=['key1','key2'], how='right')

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [52]:
pd.merge(links,rechts,on=['key1','key2'], how='left')

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [53]:
links

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [54]:
rechts

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [55]:
links.join(rechts)

ValueError: columns overlap but no suffix specified: Index(['key1', 'key2'], dtype='object')

In [58]:
links.join(rechts, how="outer")

ValueError: columns overlap but no suffix specified: Index(['key1', 'key2'], dtype='object')

In [59]:
rechts.join(links)

ValueError: columns overlap but no suffix specified: Index(['key1', 'key2'], dtype='object')

In [2]:
df = pd.DataFrame({'spa1':[1,2,3,4],'spa2':[444,555,666,444],'spa3':['abc','def','ghi','xyz']})
df.head()

   spa1  spa2 spa3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df['spa2'].unique()

array([444, 555, 666], dtype=int64)

In [7]:
df['spa2'].nunique()

3

In [8]:
df['spa2'].value_counts()

444    2
555    1
666    1
Name: spa2, dtype: int64

In [11]:
newdf= df[(df['spa1']> 2) & (df['spa2'] == 444)]

In [12]:
newdf

   spa1  spa2 spa3
3     4   444  xyz

In [14]:
def mal2(x):
    return x*2

In [15]:
df['spa1'].apply(mal2)

0    2
1    4
2    6
3    8
Name: spa1, dtype: int64

In [16]:
df['spa3'].apply(len)

0    3
1    3
2    3
3    3
Name: spa3, dtype: int64

In [17]:
df['spa2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: spa2, dtype: int64

In [19]:
df['spa1'].min()

1

In [24]:
df.drop('spa1')

KeyError: "['spa1'] not found in axis"

In [21]:
del df['spa1']

In [22]:
df

   spa2 spa3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [25]:
df.columns

Index(['spa2', 'spa3'], dtype='object')

In [26]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [27]:
df

   spa2 spa3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [30]:
df.sort_values(by='spa2', inplace=True)

In [31]:
df.isnull()

    spa2   spa3
0  False  False
3  False  False
1  False  False
2  False  False

In [32]:
df.dropna()

   spa2 spa3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [33]:
df = pd.DataFrame({'spa1':[1,2,3,np.nan],
                   'spa2':[np.nan,555,666,444],
                   'spa3':['abc','def','ghi','xyz']})
df.head()

   spa1   spa2 spa3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [34]:
df.fillna(0)

   spa1   spa2 spa3
0   1.0    0.0  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   0.0  444.0  xyz

In [35]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [36]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [40]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [42]:
pwd

'C:\\Users\\Oliver\\Desktop\\Udemy\\Python für Data Science, Machine Learning und Visualization\\Übungen\\Ü3\\Video'

In [43]:
df = pd.read_csv('example.csv')

In [44]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [45]:
df.to_csv('meine_bla.csv')

In [50]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [51]:
df.to_excel('Mein_Excel.xlsx', sheet_name='Shit1')

In [52]:
df_html = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [54]:
df_html = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [55]:
type(df_html)

list

In [59]:
df_html[0].head()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534

In [61]:
from sqlalchemy import create_engine

In [63]:
engine = create_engine('sqlite:///:memory:')

In [64]:
df.to_sql('Daten', engine)

4

In [65]:
sql_df = pd.read_sql('Daten', con= engine)

In [66]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15